In [7]:
import pandas as pd
Country = pd.read_csv('country.csv')

In [8]:
rslt_df = Country[Country['Population'] > 100000000]
rslt_df

       Name  Population     Area     GDP Currency
1     Japan   126045000   377835  4938.0      YEN
4  Brazilia   208360000  8515770  1798.0     REAL

In [9]:
record = {
  'Name': ['Ankit', 'Amit', 'Aishwarya', 'Priyanka', 'Priya', 'Shaurya' ],
  'Age': [21, 19, 20, 18, 17, 21],
  'Stream': ['Math', 'Commerce', 'Science', 'Math', 'Math', 'Science'],
  'Percentage': [88, 92, 95, 70, 65, 78]}
  
# create a dataframe
dataframe = pd.DataFrame(record, columns = ['Name', 'Age', 'Stream', 'Percentage'])
  
print("Given Dataframe :\n", dataframe) 
  
options = ['Math', 'Commerce']
  
# selecting rows based on condition
rslt_df = dataframe.loc[dataframe['Stream'].isin(options)]
  
print('\nResult dataframe :\n', rslt_df)

Given Dataframe :
         Name  Age    Stream  Percentage
0      Ankit   21      Math          88
1       Amit   19  Commerce          92
2  Aishwarya   20   Science          95
3   Priyanka   18      Math          70
4      Priya   17      Math          65
5    Shaurya   21   Science          78

Result dataframe :
        Name  Age    Stream  Percentage
0     Ankit   21      Math          88
1      Amit   19  Commerce          92
3  Priyanka   18      Math          70
4     Priya   17      Math          65

In [13]:
dataframe[dataframe['Name'].str.match('P')]

       Name  Age Stream  Percentage
3  Priyanka   18   Math          70
4     Priya   17   Math          65

In [17]:
dataframe[dataframe['Name'].str.contains('a',na=False, case=False)]

        Name  Age    Stream  Percentage
0      Ankit   21      Math          88
1       Amit   19  Commerce          92
2  Aishwarya   20   Science          95
3   Priyanka   18      Math          70
4      Priya   17      Math          65
5    Shaurya   21   Science          78

In [18]:
dataframe.sort_values('Age')

        Name  Age    Stream  Percentage
4      Priya   17      Math          65
3   Priyanka   18      Math          70
1       Amit   19  Commerce          92
2  Aishwarya   20   Science          95
0      Ankit   21      Math          88
5    Shaurya   21   Science          78

In [19]:
dataframe.query('Age>18')

        Name  Age    Stream  Percentage
0      Ankit   21      Math          88
1       Amit   19  Commerce          92
2  Aishwarya   20   Science          95
5    Shaurya   21   Science          78

In [20]:
dataframe['Percentage'].mean()

81.33333333333333